export const regions = [
  {
    id: "special",
    name: "ส่วนกลาง / ทั่วประเทศ / ไม่ระบุ",
    provinces: [
      "ส่วนกลาง",
      "ทั่วประเทศ",
      "ไม่ระบุ"
    ],
  },
  {
    id: "north",
    name: "ภาคเหนือ",
    provinces: [
      "เชียงราย", "เชียงใหม่", "น่าน", "พะเยา", "แพร่",
      "แม่ฮ่องสอน", "ลำปาง", "ลำพูน", "อุตรดิตถ์"
    ],
  },
  {
    id: "northeast",
    name: "ภาคตะวันออกเฉียงเหนือ",
    provinces: [
      "กาฬสินธุ์", "ขอนแก่น", "ชัยภูมิ", "นครพนม", "นครราชสีมา",
      "บึงกาฬ", "บุรีรัมย์", "มหาสารคาม", "มุกดาหาร", "ยโสธร",
      "ร้อยเอ็ด", "เลย", "ศรีสะเกษ", "สกลนคร", "สุรินทร์",
      "หนองคาย", "หนองบัวลำภู", "อำนาจเจริญ", "อุดรธานี", "อุบลราชธานี"
    ],
  },
  {
    id: "central",
    name: "ภาคกลาง",
    provinces: [
      "กรุงเทพมหานคร", "กำแพงเพชร", "ชัยนาท", "นครนายก", "นครปฐม",
      "นครสวรรค์", "นนทบุรี", "ปทุมธานี", "พิจิตร", "พิษณุโลก",
      "เพชรบูรณ์", "พระนครศรีอยุธยา", "ลพบุรี", "สมุทรปราการ", "สมุทรสงคราม",
      "สมุทรสาคร", "สระบุรี", "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี",
      "อ่างทอง", "อุทัยธานี"
    ],
  },
  {
    id: "east",
    name: "ภาคตะวันออก",
    provinces: [
      "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ตราด", "ปราจีนบุรี",
      "ระยอง", "สระแก้ว"
    ],
  },
  {
    id: "west",
    name: "ภาคตะวันตก",
    provinces: [
      "กาญจนบุรี", "ตาก", "ประจวบคีรีขันธ์", "เพชรบุรี", "ราชบุรี"
    ],
  },
  {
    id: "south",
    name: "ภาคใต้",
    provinces: [
      "กระบี่", "ชุมพร", "ตรัง", "นครศรีธรรมราช", "นราธิวาส",
      "ปัตตานี", "พังงา", "พัทลุง", "ภูเก็ต", "ยะลา",
      "ระนอง", "สงขลา", "สตูล", "สุราษฎร์ธานี"
    ],
  },
];